1C_base/DataProcessors/ИнтеграцияРакеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияРакеты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

1C_base/Catalogs/Корабли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Корабли</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеРакеты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРакеты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРакеты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компания</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1C_base/DataProcessors/ИнтеграцияРакеты/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ОтправитьЗапрос(Команда)
	ОтправитьЗапросНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправитьЗапросНаСервере()
	Сервер = "/api.spacexdata.com";
	Ресурс = "/v3/rockets"; 
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL;
	
	Попытка
		Соединение = Новый HTTPСоединение(Сервер,443,,,,100,ЗащищенноеСоединение);
	Исключение
		Возврат;
	КонецПопытки;
	
	ЗапросПолученияСообщения = Новый HTTPЗапрос(Ресурс); 
	Попытка
		Объект.Ответ = Соединение.ВызватьHTTPМетод("GET", ЗапросПолученияСообщения).ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка " + ОписаниеОшибки();
		Сообщение.Сообщить();
		Возврат;
	КонецПопытки;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Объект.Ответ);
	Структура = ПрочитатьJSON(ЧтениеJSON);
	ЧтениеJSON.Закрыть();
	КорабльСоздан = "";
	КорабльСоздан = ПолучитьСтрокуНаименованийКораблей();
	
	Для каждого строка из Структура Цикл
		Если СтрНайти(КорабльСоздан, строка.rocket_name) Тогда
			Продолжить;
		КонецЕсли;
		НовыйЭлементСправочникаКорабли = Справочники.Корабли.СоздатьЭлемент();
		НовыйЭлементСправочникаКорабли.ИД = строка.id;
		НовыйЭлементСправочникаКорабли.Наименование = строка.rocket_name;
		НовыйЭлементСправочникаКорабли.НаименованиеРакеты = строка.rocket_name;
		НовыйЭлементСправочникаКорабли.ИДРакеты = строка.rocket_id;
		НовыйЭлементСправочникаКорабли.ТипРакеты = строка.rocket_type;
		НовыйЭлементСправочникаКорабли.Активный = строка.active;
		
		НовыйЭлементСправочникаКорабли.Компания = строка.company;
		НовыйЭлементСправочникаКорабли.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьСтрокуНаименованийКораблей()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Корабли.Ссылка
		|ИЗ
		|	Справочник.Корабли КАК Корабли";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СтрокаНаименованийКораблей = "";
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрокаНаименованийКораблей = СтрокаНаименованийКораблей + " " + ВыборкаДетальныеЗаписи.Ссылка + Символы.ПС;
	КонецЦикла;
	
	Возврат СтрокаНаименованийКораблей;

КонецФункции
